{"keras_version": "2.0.4", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"name": "dense_17", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dtype": "float32", "units": 16, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "batch_input_shape": [null, 717], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 1}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_13", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_13"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_9", "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_18", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 8, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 1}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_14", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_14"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_10", "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_19", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 4, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 1}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_15", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_15"}}, {"class_name": "Dense", "config": {"name": "dense_20", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 1, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null}}], "backend": "tensorflow"}