{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 16, "bias_regularizer": null, "activation": "linear", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 30, "axis": 0}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "batch_input_shape": [null, 717], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_133"}}, {"class_name": "BatchNormalization", "config": {"center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "name": "batch_normalization_100", "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_100", "alpha": 0.30000001192092896, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_67", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 8, "bias_regularizer": null, "activation": "linear", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 30, "axis": 0}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_134"}}, {"class_name": "BatchNormalization", "config": {"center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "name": "batch_normalization_101", "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_101", "alpha": 0.30000001192092896, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_68", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 4, "bias_regularizer": null, "activation": "linear", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 30, "axis": 0}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_135"}}, {"class_name": "BatchNormalization", "config": {"center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "name": "batch_normalization_102", "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_102", "alpha": 0.30000001192092896, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 1, "bias_regularizer": null, "activation": "tanh", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_136"}}], "keras_version": "2.0.4"}