{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"use_bias": true, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 10, "axis": 0}}, "name": "dense_13", "dtype": "float32", "trainable": true, "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "batch_input_shape": [null, 717], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_10", "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_10", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_7", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 10, "axis": 0}}, "name": "dense_14", "kernel_regularizer": null, "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_11", "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_11", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_8", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 10, "axis": 0}}, "name": "dense_15", "kernel_regularizer": null, "units": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_12", "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_12", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "tanh", "activity_regularizer": null, "kernel_constraint": null, "name": "dense_16", "kernel_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.0.4"}