{"config": [{"config": {"bias_regularizer": null, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 66], "activation": "linear", "use_bias": true, "kernel_constraint": {"config": {"max_value": 0.5, "axis": 0}, "class_name": "MaxNorm"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_237", "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "center": true, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_178", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_178", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "name": "dropout_119", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "units": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "use_bias": true, "kernel_constraint": {"config": {"max_value": 0.5, "axis": 0}, "class_name": "MaxNorm"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_238", "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "center": true, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_179", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_179", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "name": "dropout_120", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "units": 4, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "use_bias": true, "kernel_constraint": {"config": {"max_value": 0.5, "axis": 0}, "class_name": "MaxNorm"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_239", "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "center": true, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_180", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_180", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"bias_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "sigmoid", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_240", "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4"}