{"config": [{"config": {"batch_input_shape": [null, 717], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "name": "dense_157", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": {"config": {"max_value": 1, "axis": 0}, "class_name": "MaxNorm"}, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "dtype": "float32", "units": 8}, "class_name": "Dense"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "momentum": 0.99, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_118", "axis": -1, "epsilon": 0.001, "beta_constraint": null, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_118", "trainable": true, "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"rate": 0.5, "name": "dropout_79", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "name": "dense_158", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": {"config": {"max_value": 1, "axis": 0}, "class_name": "MaxNorm"}, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "units": 4}, "class_name": "Dense"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "momentum": 0.99, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_119", "axis": -1, "epsilon": 0.001, "beta_constraint": null, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_119", "trainable": true, "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"rate": 0.5, "name": "dropout_80", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "name": "dense_159", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": {"config": {"max_value": 1, "axis": 0}, "class_name": "MaxNorm"}, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "units": 2}, "class_name": "Dense"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "momentum": 0.99, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_120", "axis": -1, "epsilon": 0.001, "beta_constraint": null, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_120", "trainable": true, "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "name": "dense_160", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "bias_constraint": null, "units": 1}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4"}